// 移位操作
public class BitOperatorDemo2 {
	public static void main(String[] args) {
		/*
		 * 2的二进制:
		 * 00000000_00000000_00000000_00000010
		 * 左移3位
		 * 00000_00000000_00000000_00000010000
		 * 16的二进制:
		 * 右移三位
		 * 00000000_00000000_00000000_00000010
		 */
		
		System.out.println(2 << 3); // 16
		
		System.out.println(16 >> 3); // 2
		
		/*
		 * 源码：10000_00000000_00000000_00000010000
		 * 反码：11111_11111111_11111111_11111101111 （最高位是符号位，不能改变，正数的符号位为0，负数为1）
		 * 补码：11111_11111111_11111111_11111110000 （反码的基础上+1）
		 * 右移动3位
		 *       11111111_11111111_11111111_11111110  (-2的补码)
		 */
		System.out.println(-16 >> 3); // -2
	}
}
